<a href="https://colab.research.google.com/github/UsmanAi/Pandas_ml/blob/master/pandas_ml.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [0]:
import numpy as np
import pandas as pd

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [0]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [3]:
df = pd.DataFrame(data=data,index= labels)
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [4]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe**

In [7]:
df.iloc[:2]

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [8]:
df[['birds','age']]

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [17]:
# Approach 1
df.iloc[[2,3,7],:-1]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

In [14]:
#Approach 2
df.iloc[[2,3,7]].loc[:,['birds', 'age', 'visits']]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

Note: Approach 2 is better and practical one. In Approach 1 had to manually check the indexes of columns. This is not the case in Approach 2.

**6. select the rows where the number of visits is less than 4**

In [18]:
filt= (df['visits']<4)
df.loc[filt]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [25]:
filt = df['age'].isnull()
df.loc[filt,['birds', 'visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [27]:
filt = (df['birds'] == 'Cranes') & (df['age']<4)
df.loc[filt]

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [28]:
filt = (df['age'] >=2) & (df['age'] <=4)
df.loc[filt]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [39]:
# Approach 1
filt = (df['birds'] == 'Cranes')
df_crane = df.loc[filt]
df_crane.loc[:,'visits'].sum()

12

In [40]:
# Approach 2
g = df.groupby('birds')
a = g.get_group('Cranes')
a

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes
f  Cranes  3.0       4       no
h  Cranes  NaN       2      yes

In [41]:
a['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [0]:
agg = g.mean()
agg

            age  visits
birds
Cranes      3.5     3.0
plovers     3.5     2.5
spoonbills  6.0     3.0

In [0]:
agg[['age']]

            age
birds
Cranes      3.5
plovers     3.5
spoonbills  6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [0]:
df.head(1)

    birds  age  visits priority
a  Cranes  3.5       2      yes

In [0]:
d1 =  {'birds':'Some Bird', 'age':np.nan, 'visits':np.nan, 'priority':'Anything'}
d1

{'birds': 'Some Bird', 'age': nan, 'visits': nan, 'priority': 'Anything'}

In [0]:
df2 = pd.DataFrame(d1, index=['some_index'])
df2

                birds  age  visits  priority
some_index  Some Bird  NaN     NaN  Anything

In [0]:
df3=pd.concat([df,df2])
df3

                 birds  age  visits  priority
a               Cranes  3.5     2.0       yes
b               Cranes  4.0     4.0       yes
c              plovers  1.5     3.0        no
d           spoonbills  NaN     4.0       yes
e           spoonbills  6.0     3.0        no
f               Cranes  3.0     4.0        no
g              plovers  5.5     2.0        no
h               Cranes  NaN     2.0       yes
i           spoonbills  8.0     3.0        no
j           spoonbills  4.0     2.0        no
some_index   Some Bird  NaN     NaN  Anything

In [0]:
df3.drop('some_index',inplace = True)
df3

        birds  age  visits priority
a      Cranes  3.5     2.0      yes
b      Cranes  4.0     4.0      yes
c     plovers  1.5     3.0       no
d  spoonbills  NaN     4.0      yes
e  spoonbills  6.0     3.0       no
f      Cranes  3.0     4.0       no
g     plovers  5.5     2.0       no
h      Cranes  NaN     2.0      yes
i  spoonbills  8.0     3.0       no
j  spoonbills  4.0     2.0       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [0]:
df['birds'].value_counts()

spoonbills    4
Cranes        4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [0]:
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [0]:
#first it will sort the 'age' after that it will sort visits
df4 = df.sort_values(by=['age','visits'],ascending=[False,True])
df4

        birds  age  visits priority
i  spoonbills  8.0       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
j  spoonbills  4.0       2       no
b      Cranes  4.0       4      yes
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
h      Cranes  NaN       2      yes
d  spoonbills  NaN       4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [0]:
df['priority'].replace('yes',1,inplace=True)
df['priority'].replace('no',0,inplace=True)
df

        birds  age  visits  priority
a      Cranes  3.5       2         1
b      Cranes  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f      Cranes  3.0       4         0
g     plovers  5.5       2         0
h      Cranes  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [0]:
df['birds'].replace('Cranes','trumpeters',inplace=True)
df

        birds  age  visits  priority
a  trumpeters  3.5       2         1
b  trumpeters  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f  trumpeters  3.0       4         0
g     plovers  5.5       2         0
h  trumpeters  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0